app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `blog`
---
    function index()
    {
        $this->data['pageTitle'] = 'Dashboard Pages';
        $this->data['currentAdminMenu'] = 'dashboard';
        $this->data['currentAdminSubMenu'] = 'dashboard';
        $this->data['countBlog'] = $this->blogModel->countAll();