app/Controllers/Admin/Products.php

    public function index()
    {
        $data = [
            // 'bake' => $this->blogModel->getblog(),
            'data' => $this->blogModel->paginate(4, 'blog'),
---
SELECT *
FROM `blog`
 LIMIT 8, 4
SELECT COUNT(*) AS `numrows`
FROM `blog`


        $slug = url_title($this->request->getVar('judul'), '-', true);

        $this->blogModel->save([
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'isi_teks' => $this->request->getVar('isi_teks'),
            'foto' => $namepicture,
        ]);
---
INSERT INTO `blog` (`judul`, `slug`, `isi_teks`, `foto`, `created_at`, `updated_at`) VALUES ('evwev', 'evwev', '<p>isi blog</p><p><img src=\"http://akusiapsekolah.test/gambar/1665042962_5bbecfc023aca9a81515.jpg\"></p><p>&nbsp;</p><p>cwvwvavavdvaavd</p>', '1665042971_7b0b102ddc496396e53b.png', '2022-10-06 02:56:11', '2022-10-06 02:56:11')