app/Controllers/Blog.php

SELECT *
FROM `blog`
---
    public function index()
    {
        $dataBlog = $this->blogModel->table('blog')->findAll();