app/Models/BlogModel.php

SELECT *
FROM `blog`
WHERE `slug` = 'qj35j6qj5j35'
 LIMIT 1
---
    public function getBlog($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();